{
  "titleSkills": "Области знаний",
  "firstSubtitleSkills": "Технические навыки:",
  "secondSubtitleSkills": "Инструменты и методологии:",
  "titleExperience": "Опыт",
  "firstItemTitle": "Фронтэнд-разработчик",
  "secondItemTitle": "Фронтэнд-разработчик",
  "thirdItemTitle": "Верстальщик сайтов",
  "experienceItemSubtitle": "компания:",
  "titleBiography": "Биография",
  "phraseBiography": "Непрерывное обучение — ключ к открытию новых горизонтов.",
  "firstDescriptionBiography": "Меня зовут Руслан, я фронтэнд-разработчик, занимаюсь разработкой интерактивных и адаптивных веб-приложений. У меня также обширный опыт в верстке сайтов. Разработал блог на React в составе команды, где моя роль заключалась в создании всего пользовательского интерфейса, включая работу с API, создание тем, настройку международной локализации (i18n), управление состоянием с Redux Toolkit, а также проработку взаимодействия с пользователем и анимации.",
  "secondDescriptionBiography": "Я остаюсь приверженным командной работе и открыт к возможностям трудоустройства в компании, где я мог бы применить свои навыки и продолжить учиться у опытных коллег.",
  "thirdDescriptionBiography": "Мой подход к работе — это сочетание практических знаний, гибкости и стремления к совершенству. Каждый новый проект для меня — это шанс улучшить свои умения и внести вклад в успех команды.",
  "Download RP": "Скачать CV",
  "firstItemResponsibilities": "Разрабатываю и поддерживаю пользовательские интерфейсы, интегрирую RESTful API и управляю состоянием приложений. Настраиваю процессы разработки, включая CI/CD и стандартизацию кода, обеспечиваю интернационализацию и стабильность UI. Моя работа направлена на создание удобных и качественных цифровых решений, соответствующих современным стандартам.",
  "secondItemResponsibilities": "Разрабатывал и поддерживал UI-компоненты на React, отвечая за их визуальную и функциональную часть. Проект был блогом для солнечного оборудования и его установки. Интегрировал RESTful API и создавал виртуальные списки для больших данных. Писал простые тесты с Jest, настраивал переключение тем и поддержку нескольких языков через i18n. Сотрудничал с дизайнерами, используя свой опыт проектирования для создания удобных интерфейсов. Настраивал CI/CD пайплайны, Storybook и тестирование с Loki для контроля качества.",
  "thirdItemResponsibilities": "Разрабатывал динамические сайты с анимацией и адаптивным дизайном, обеспечивая их производительность и удобство использования. Был ментором на курсе для начинающих разработчиков и готовил проекты для интеграции с Vue, создавая качественные, оптимизированные решения. Самостоятельно сверстал сайт для аналитики по киберспорту, включающий более 60 страниц. Разрабатывал мобильные версии веб-сайтов без готовых дизайнов."
}
