{
  "titleSkills": "Області знань",
  "firstSubtitleSkills": "Технічні навички:",
  "secondSubtitleSkills": "Інструменти та методології:",
  "titleExperience": "Досвід",
  "firstItemTitle": "Фронтенд-розробник",
  "secondItemTitle": "Фронтенд-розробник",
  "thirdItemTitle": "Верстальник сайтів",
  "experienceItemSubtitle": "компанія:",
  "titleBiography": "Біографія",
  "phraseBiography": "Неперервне навчання — ключ до відкриття нових горизонтів.",
  "firstDescriptionBiography": "Мене звуть Руслан, я фронтенд-розробник і займаюсь розробкою інтерактивних та адаптивних веб-додатків. Також маю великий досвід у верстці сайтів. Розробив блог на React у складі команди, де моя роль полягала у створенні всього користувацького інтерфейсу, включаючи роботу з API, створення тем, налаштування міжнародної локалізації (i18n), управління станом з Redux Toolkit, а також опрацювання взаємодії з користувачем та анімації.",
  "secondDescriptionBiography": "Я залишаюся відданим командній роботі та відкритий до можливостей працевлаштування в компанії, де я міг би застосувати свої навички та продовжити навчання у досвідчених колег.",
  "thirdDescriptionBiography": "Мій підхід до роботи — це поєднання практичних знань, гнучкості та прагнення до досконалості. Кожен новий проект для мене — це шанс покращити свої вміння та внести вклад в успіх команди.",
  "Download RP": "Завантажити CV",
  "firstItemResponsibilities": "Розробляю та підтримую користувацькі інтерфейси, інтегрую RESTful API та керую станом додатків. Налаштовую процеси розробки, включаючи CI/CD та стандартизацію коду, забезпечую інтернаціоналізацію та стабільність UI. Моя робота спрямована на створення зручних та якісних цифрових рішень, що відповідають сучасним стандартам.",
  "secondItemResponsibilities": "Розробляв та підтримував UI-компоненти на React, відповідаючи за їх візуальну та функціональну частину. Проект був блогом для сонячного обладнання та його встановлення. Інтегрував RESTful API та створював віртуальні списки для великих обсягів даних. Писав прості тести з використанням Jest, налаштовував перемикання тем і підтримку кількох мов через i18n. Співпрацював із дизайнерами, використовуючи свій досвід проектування для створення зручних інтерфейсів. Налаштовував CI/CD пайплайни, Storybook та тестування з Loki для контролю якості.",
  "thirdItemResponsibilities": "Розробляв динамічні сайти з анімаціями та адаптивним дизайном, забезпечуючи їх продуктивність та зручність використання. Був ментором на курсі для початківців-розробників та готував проєкти для інтеграції з Vue, створюючи якісні, оптимізовані рішення. Самостійно зверстав сайт для аналітики з кіберспорту, що включав понад 60 сторінок. Розробляв мобільні версії веб-сайтів без готових дизайнів."
}
