{
  "titleSkills": "Knowledge Areas",
  "firstSubtitleSkills": "Technical Skills:",
  "secondSubtitleSkills": "Tools and Methodologies:",
  "titleExperience": "Experience",
  "firstItemTitle": "Front-End Developer",
  "secondItemTitle": "Junior Front-End Developer",
  "thirdItemTitle": "Website Layout Developer",
  "experienceItemSubtitle": "company:",
  "titleBiography": "biography",
  "phraseBiography": "Continuous learning is the key to opening new horizons.",
  "firstDescriptionBiography": "My name is Ruslan, and I am on a path of continuous learning and professional growth in front-end development. My career began with website layout development, where I gained strong skills and experience. After that, I worked as a junior developer in Slovakia, which allowed me to dive into teamwork and get acquainted with front-end development on a deeper level.",
  "secondDescriptionBiography": "Now, I am actively growing as a freelancer, taking on various projects, and constantly expanding my knowledge. Despite this, I remain committed to teamwork and am open to employment opportunities in a company where I can apply my skills and continue learning from experienced colleagues.",
  "thirdDescriptionBiography": "My approach to work combines practical knowledge, flexibility, and a drive for excellence. Every new project is an opportunity to improve my skills and contribute to the success of the team.",
  "Download RP": "Download CV",
  "firstItemResponsibilities": "I develop and maintain user interfaces, integrate RESTful APIs, and manage application state. I set up development processes, including CI/CD and code standardization, ensure internationalization, and maintain UI stability. My work focuses on creating user-friendly and high-quality digital solutions that meet modern standards.",
  "secondItemResponsibilities": "Developed and maintained UI components in React, ensuring their visual and functional aspects. The project was a blog about solar equipment and its installation. Integrated RESTful APIs and created virtual lists for large datasets. Wrote simple tests using Jest, set up theme switching and multilingual support via i18n. Collaborated with designers, leveraging my design experience to create user-friendly interfaces. Configured CI/CD pipelines, Storybook, and Loki testing for quality control.",
  "thirdItemResponsibilities": "Developed dynamic websites with animation and adaptive design, ensuring their performance and user-friendliness. Mentored beginner developers in a course and prepared projects for Vue integration, creating high-quality, optimized solutions. Independently built a website for eSports analytics, including more than 60 pages. Developed mobile versions of websites without ready-made designs."
}
