{
  "titleSkills": "Oblasti vedomostí",
  "firstSubtitleSkills": "Technické zručnosti:",
  "secondSubtitleSkills": "Nástroje a metodológie:",
  "titleExperience": "Skúsenosti",
  "firstItemTitle": "Front-End Developer",
  "secondItemTitle": "Junior Front-End Developer",
  "thirdItemTitle": "Kodér webových stránok",
  "experienceItemSubtitle": "spoločnosť:",
  "titleBiography": "Biografia",
  "phraseBiography": "Neustále vzdelávanie je kľúčom k otváraniu nových horizontov.",
  "firstDescriptionBiography": "Volám sa Ruslan, som frontend developer a venujem sa vývoju interaktívnych a adaptívnych webových aplikácií. Mám tiež rozsiahle skúsenosti s tvorbou rozloženia webových stránok. Vyvinul som blog na Reacte v rámci tímu, kde moja úloha zahŕňala vytvorenie celého používateľského rozhrania, vrátane práce s API, tvorby tém, nastavenia medzinárodnej lokalizácie (i18n), riadenia stavu s Redux Toolkit, ako aj prepracovanie používateľskej interakcie a animácií.",
  "secondDescriptionBiography": "Zostávam oddaný tímovej práci a som otvorený možnostiam zamestnania v spoločnosti, kde by som mohol uplatniť svoje schopnosti a pokračovať v učení sa od skúsených kolegov.",
  "thirdDescriptionBiography": "Môj prístup k práci je kombináciou praktických znalostí, flexibility a túžby po dokonalosti. Každý nový projekt je pre mňa príležitosťou zlepšiť svoje schopnosti a prispieť k úspechu tímu.\n\n",
  "Download RP": "Stiahnuť CV",
  "firstItemResponsibilities": "Vyvíjam a udržiavam používateľské rozhrania, integrujem RESTful API a spravujem stav aplikácií. Nastavujem vývojové procesy vrátane CI/CD a štandardizácie kódu, zabezpečujem internacionalizáciu a stabilitu používateľského rozhrania. Moja práca sa zameriava na vytváranie používateľsky prívetivých a vysokokvalitných digitálnych riešení, ktoré spĺňajú moderné štandardy.",
  "secondItemResponsibilities": "Vyvíjal a udržiaval UI komponenty v Reacte, zabezpečujúc ich vizuálnu a funkčnú časť. Projekt bol blog o solárnom zariadení a jeho inštalácii. Integroval RESTful API a vytváral virtuálne zoznamy pre veľké objemy údajov. Písal jednoduché testy pomocou Jest, nastavoval prepínanie tém a podporu viacerých jazykov cez i18n. Spolupracoval s dizajnérmi, využívajúc svoje skúsenosti s navrhovaním na vytváranie používateľsky prívetivých rozhraní. Nastavoval CI/CD pipeline, Storybook a testovanie s Loki pre kontrolu kvality.",
  "thirdItemResponsibilities": "Vyvíjal dynamické webové stránky s animáciami a adaptívnym dizajnom, zabezpečujúc ich výkon a pohodlie používateľa. Bol mentorom v kurze pre začínajúcich vývojárov a pripravoval projekty na integráciu s Vue, vytvárajúc kvalitné, optimalizované riešenia. Samostatne vytvoril webovú stránku pre analytiku e-športu, ktorá obsahovala viac ako 60 stránok. Vyvíjal mobilné verzie webových stránok bez pripravených dizajnov."
}
